app/controllers/bugs_controller.rb

SELECT "bugs".* FROM "bugs"
---
  def index
    @bugs = Bug.all

SELECT "bugs".* FROM "bugs" WHERE "bugs"."id" = ? LIMIT 1  [["id", "search"]]
---
  def show
    @bug = Bug.find(params[:id])

SELECT "bugs".* FROM "bugs" WHERE "bugs"."id" = ? LIMIT 1  [["id", "4"]]
---
  def edit
    @bug = Bug.find(params[:id])

INSERT INTO "bugs" ("created_at", "detail", "process", "title", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Mon, 19 Dec 2011 09:09:26 UTC +00:00], ["detail", ""], ["process", ""], ["title", ""], ["updated_at", Mon, 19 Dec 2011 09:09:26 UTC +00:00]]
---
  def create
    @bug = Bug.new(params[:bug])

    respond_to do |format|
      if @bug.save

SELECT "bugs".* FROM "bugs" WHERE "bugs"."id" = ? LIMIT 1  [["id", "4"]]
---
  def update
    @bug = Bug.find(params[:id])

SELECT "bugs".* FROM "bugs" WHERE "bugs"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "bugs" WHERE "bugs"."id" = ?  [["id", 1]]
---
  def destroy
    @bug = Bug.find(params[:id])
    @bug.destroy